# # # # # # # # 早餐 =["蛋餅","三明治","漢堡","飯團"]
# # # # # # # # for 餐點 in 早餐:print(餐點)
# # # # # #
# # # # # # # 学生=["小明","小华","小杰","阿花"]
# # # # # # # for 点名 in 学生:print(点名)
# # # # # #
# # # # # # 数列 =[1,2,3,4,5,6]
# # # # # # 乘积 =1
# # # # # # for 数字 in 数列:
# # # # # #      乘积 *= 数字
# # # # # # print(乘积)
# # # # #
# # # # # 數列 =[1,2,3,4,5,6]
# # # # # 清單 = []
# # # # # for 數字 in 數列:
# # # # #     if 數字 > 3:
# # # # #        清單.append(數字)   #扩展
# # # # # print(清單)
# # # #
# # # # 數列 =[1,-2,3,-4,5,-6]
# # # # 正值 =[]
# # # # 負值 =[]
# # # # for 數字 in 數列:
# # # #     if 數字 > 0:
# # # #        正值.append(數字)
# # # #     else:
# # # #        負值.append(數字)
# # # # print(f"正值的數字包含了{正值}")
# # # # print(f"負值的數字包含了{負值}")
# # # def 加法(x,y):
# # #     return x+y
# # # def 減法(x,y):
# # #     return x-y
# # # def 乘法(x,y):
# # #     return x*y
# # # def 除法(x,y):
# # #     商數 =x // y
# # #     餘數 = x% y
# # #     return 商數,餘數
# # # while True:
# # #     計算類型 = input("請輸入計算類型(1)加(2)減(3)乘(4)除(或按其它任意鍵關閉程式):")
# # #     if 計算類型 in ("1","2","3","4"):
# # #        數字1 = int(input("請輸入第一個整数:"))
# # #        數字2 = int(input("請输入第二個整数:"))
# # #     if 計算類型 =="1":
# # #        print(f"{數字1}加{數字2} 等於{加法(數字1,數字2)}")
# # #     elif 計算類型 =="2":
# # #        print(f"{數字1} 減{數字2} 等於{減法(數字1,數字2)}")
# # #     elif 計算類型 =="3":
# # #        print(f"{數字1} 乘{數字2} 等於{乘法(數字1,數字2)}")
# # #     elif 計算類型 =="4":
# # #          if 數字1 % 數字2 == 0:
# # #            print(f"{數字1} 除以 {數字2} 等於 {除法(數字1,數字2)[0]}")
# # #          else:
# # #            print(f"{數字1} 除以 {數字2} 等於{除法(數字1,數字2)[0]} 餘{除法(數字1,數字2)[1]}")
# # #     else:
# # #         print("拜拜~")
# # #         break
# # import my_module as hi
# # hi.打招呼("小明")
# import requests
# 城市 = input("請輸入城市名稱:")
# api ="7f1a9376d21b282af01bda4bc8f83244"
# 網址 = f"https://api.openweathermap.org/data/2.5/weather?g={城市}&appid={api}"
# 天氣資料 = requests.get(網址)
# 氣溫 = int(天氣資料.json()["main"]["temp"]-273.15)
# print(f"{城市}目前的氣溫是{氣溫}度")

class 遊戲角色:
    等級 = 1
    經驗值 = 0
    def __init__(self,姓名,年齡):
        self.姓名 = 姓名
        self.年齡 = 年齡
玩家1 = 遊戲角色("小明",24)
玩家2 = 遊戲角色("小華",22)
print(玩家1.姓名)
print(玩家2.年齡)